xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HP_PROCON_P4_Bits.S148L */
#define IFX_DMU_HP_PROCON_P4_S148L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P4_Bits.S148L */
#define IFX_DMU_HP_PROCON_P4_S148L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P4_Bits.S148L */
#define IFX_DMU_HP_PROCON_P4_S148L_OFF (20u)

/** \brief Length for Ifx_DMU_HP_PROCON_P4_Bits.S149L */
#define IFX_DMU_HP_PROCON_P4_S149L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P4_Bits.S149L */
#define IFX_DMU_HP_PROCON_P4_S149L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P4_Bits.S149L */
#define IFX_DMU_HP_PROCON_P4_S149L_OFF (21u)

/** \brief Length for Ifx_DMU_HP_PROCON_P4_Bits.S150L */
#define IFX_DMU_HP_PROCON_P4_S150L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P4_Bits.S150L */
#define IFX_DMU_HP_PROCON_P4_S150L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P4_Bits.S150L */
#define IFX_DMU_HP_PROCON_P4_S150L_OFF (22u)

/** \brief Length for Ifx_DMU_HP_PROCON_P4_Bits.S151L */
#define IFX_DMU_HP_PROCON_P4_S151L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P4_Bits.S151L */
#define IFX_DMU_HP_PROCON_P4_S151L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P4_Bits.S151L */
#define IFX_DMU_HP_PROCON_P4_S151L_OFF (23u)

/** \brief Length for Ifx_DMU_HP_PROCON_P4_Bits.S152L */
#define IFX_DMU_HP_PROCON_P4_S152L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P4_Bits.S152L */
#define IFX_DMU_HP_PROCON_P4_S152L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P4_Bits.S152L */
#define IFX_DMU_HP_PROCON_P4_S152L_OFF (24u)

/** \brief Length for Ifx_DMU_HP_PROCON_P4_Bits.S153L */
#define IFX_DMU_HP_PROCON_P4_S153L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P4_Bits.S153L */
#define IFX_DMU_HP_PROCON_P4_S153L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P4_Bits.S153L */
#define IFX_DMU_HP_PROCON_P4_S153L_OFF (25u)

/** \brief Length for Ifx_DMU_HP_PROCON_P4_Bits.S154L */
#define IFX_DMU_HP_PROCON_P4_S154L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P4_Bits.S154L */
#define IFX_DMU_HP_PROCON_P4_S154L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P4_Bits.S154L */
#define IFX_DMU_HP_PROCON_P4_S154L_OFF (26u)

/** \brief Length for Ifx_DMU_HP_PROCON_P4_Bits.S155L */
#define IFX_DMU_HP_PROCON_P4_S155L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P4_Bits.S155L */
#define IFX_DMU_HP_PROCON_P4_S155L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P4_Bits.S155L */
#define IFX_DMU_HP_PROCON_P4_S155L_OFF (27u)

/** \brief Length for Ifx_DMU_HP_PROCON_P4_Bits.S156L */
#define IFX_DMU_HP_PROCON_P4_S156L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P4_Bits.S156L */
#define IFX_DMU_HP_PROCON_P4_S156L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P4_Bits.S156L */
#define IFX_DMU_HP_PROCON_P4_S156L_OFF (28u)

/** \brief Length for Ifx_DMU_HP_PROCON_P4_Bits.S157L */
#define IFX_DMU_HP_PROCON_P4_S157L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P4_Bits.S157L */
#define IFX_DMU_HP_PROCON_P4_S157L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P4_Bits.S157L */
#define IFX_DMU_HP_PROCON_P4_S157L_OFF (29u)

/** \brief Length for Ifx_DMU_HP_PROCON_P4_Bits.S158L */
#define IFX_DMU_HP_PROCON_P4_S158L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P4_Bits.S158L */
#define IFX_DMU_HP_PROCON_P4_S158L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P4_Bits.S158L */
#define IFX_DMU_HP_PROCON_P4_S158L_OFF (30u)

/** \brief Length for Ifx_DMU_HP_PROCON_P4_Bits.S159L */
#define IFX_DMU_HP_PROCON_P4_S159L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P4_Bits.S159L */
#define IFX_DMU_HP_PROCON_P4_S159L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P4_Bits.S159L */
#define IFX_DMU_HP_PROCON_P4_S159L_OFF (31u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S160L */
#define IFX_DMU_HP_PROCON_P5_S160L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S160L */
#define IFX_DMU_HP_PROCON_P5_S160L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S160L */
#define IFX_DMU_HP_PROCON_P5_S160L_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S161L */
#define IFX_DMU_HP_PROCON_P5_S161L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S161L */
#define IFX_DMU_HP_PROCON_P5_S161L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S161L */
#define IFX_DMU_HP_PROCON_P5_S161L_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S162L */
#define IFX_DMU_HP_PROCON_P5_S162L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S162L */
#define IFX_DMU_HP_PROCON_P5_S162L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S162L */
#define IFX_DMU_HP_PROCON_P5_S162L_OFF (2u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S163L */
#define IFX_DMU_HP_PROCON_P5_S163L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S163L */
#define IFX_DMU_HP_PROCON_P5_S163L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S163L */
#define IFX_DMU_HP_PROCON_P5_S163L_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S164L */
#define IFX_DMU_HP_PROCON_P5_S164L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S164L */
#define IFX_DMU_HP_PROCON_P5_S164L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S164L */
#define IFX_DMU_HP_PROCON_P5_S164L_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S165L */
#define IFX_DMU_HP_PROCON_P5_S165L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S165L */
#define IFX_DMU_HP_PROCON_P5_S165L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S165L */
#define IFX_DMU_HP_PROCON_P5_S165L_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S166L */
#define IFX_DMU_HP_PROCON_P5_S166L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S166L */
#define IFX_DMU_HP_PROCON_P5_S166L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S166L */
#define IFX_DMU_HP_PROCON_P5_S166L_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S167L */
#define IFX_DMU_HP_PROCON_P5_S167L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S167L */
#define IFX_DMU_HP_PROCON_P5_S167L_MSK (0x1u)

