xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxDmu_bf.h
/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S54WOP */
#define IFX_DMU_HP_PROCON_WOP1_S54WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S54WOP */
#define IFX_DMU_HP_PROCON_WOP1_S54WOP_OFF (22u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S55WOP */
#define IFX_DMU_HP_PROCON_WOP1_S55WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S55WOP */
#define IFX_DMU_HP_PROCON_WOP1_S55WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S55WOP */
#define IFX_DMU_HP_PROCON_WOP1_S55WOP_OFF (23u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S56WOP */
#define IFX_DMU_HP_PROCON_WOP1_S56WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S56WOP */
#define IFX_DMU_HP_PROCON_WOP1_S56WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S56WOP */
#define IFX_DMU_HP_PROCON_WOP1_S56WOP_OFF (24u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S57WOP */
#define IFX_DMU_HP_PROCON_WOP1_S57WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S57WOP */
#define IFX_DMU_HP_PROCON_WOP1_S57WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S57WOP */
#define IFX_DMU_HP_PROCON_WOP1_S57WOP_OFF (25u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S58WOP */
#define IFX_DMU_HP_PROCON_WOP1_S58WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S58WOP */
#define IFX_DMU_HP_PROCON_WOP1_S58WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S58WOP */
#define IFX_DMU_HP_PROCON_WOP1_S58WOP_OFF (26u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S59WOP */
#define IFX_DMU_HP_PROCON_WOP1_S59WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S59WOP */
#define IFX_DMU_HP_PROCON_WOP1_S59WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S59WOP */
#define IFX_DMU_HP_PROCON_WOP1_S59WOP_OFF (27u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S60WOP */
#define IFX_DMU_HP_PROCON_WOP1_S60WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S60WOP */
#define IFX_DMU_HP_PROCON_WOP1_S60WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S60WOP */
#define IFX_DMU_HP_PROCON_WOP1_S60WOP_OFF (28u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S61WOP */
#define IFX_DMU_HP_PROCON_WOP1_S61WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S61WOP */
#define IFX_DMU_HP_PROCON_WOP1_S61WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S61WOP */
#define IFX_DMU_HP_PROCON_WOP1_S61WOP_OFF (29u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S62WOP */
#define IFX_DMU_HP_PROCON_WOP1_S62WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S62WOP */
#define IFX_DMU_HP_PROCON_WOP1_S62WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S62WOP */
#define IFX_DMU_HP_PROCON_WOP1_S62WOP_OFF (30u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S63WOP */
#define IFX_DMU_HP_PROCON_WOP1_S63WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S63WOP */
#define IFX_DMU_HP_PROCON_WOP1_S63WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S63WOP */
#define IFX_DMU_HP_PROCON_WOP1_S63WOP_OFF (31u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S64WOP */
#define IFX_DMU_HP_PROCON_WOP2_S64WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S64WOP */
#define IFX_DMU_HP_PROCON_WOP2_S64WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S64WOP */
#define IFX_DMU_HP_PROCON_WOP2_S64WOP_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S65WOP */
#define IFX_DMU_HP_PROCON_WOP2_S65WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S65WOP */
#define IFX_DMU_HP_PROCON_WOP2_S65WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S65WOP */
#define IFX_DMU_HP_PROCON_WOP2_S65WOP_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S66WOP */
#define IFX_DMU_HP_PROCON_WOP2_S66WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S66WOP */
#define IFX_DMU_HP_PROCON_WOP2_S66WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S66WOP */
#define IFX_DMU_HP_PROCON_WOP2_S66WOP_OFF (2u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S67WOP */
#define IFX_DMU_HP_PROCON_WOP2_S67WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S67WOP */
#define IFX_DMU_HP_PROCON_WOP2_S67WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S67WOP */
#define IFX_DMU_HP_PROCON_WOP2_S67WOP_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S68WOP */
#define IFX_DMU_HP_PROCON_WOP2_S68WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S68WOP */
#define IFX_DMU_HP_PROCON_WOP2_S68WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S68WOP */
#define IFX_DMU_HP_PROCON_WOP2_S68WOP_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S69WOP */
#define IFX_DMU_HP_PROCON_WOP2_S69WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S69WOP */
#define IFX_DMU_HP_PROCON_WOP2_S69WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S69WOP */
#define IFX_DMU_HP_PROCON_WOP2_S69WOP_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S70WOP */
#define IFX_DMU_HP_PROCON_WOP2_S70WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S70WOP */
#define IFX_DMU_HP_PROCON_WOP2_S70WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S70WOP */
#define IFX_DMU_HP_PROCON_WOP2_S70WOP_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S71WOP */
#define IFX_DMU_HP_PROCON_WOP2_S71WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S71WOP */
#define IFX_DMU_HP_PROCON_WOP2_S71WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S71WOP */
#define IFX_DMU_HP_PROCON_WOP2_S71WOP_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S72WOP */
#define IFX_DMU_HP_PROCON_WOP2_S72WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S72WOP */
#define IFX_DMU_HP_PROCON_WOP2_S72WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S72WOP */
#define IFX_DMU_HP_PROCON_WOP2_S72WOP_OFF (8u)

