xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxDmu_bf.h
/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S177L */
#define IFX_DMU_HP_ECPRIO_P5_S177L_OFF (17u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S178L */
#define IFX_DMU_HP_ECPRIO_P5_S178L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S178L */
#define IFX_DMU_HP_ECPRIO_P5_S178L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S178L */
#define IFX_DMU_HP_ECPRIO_P5_S178L_OFF (18u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S179L */
#define IFX_DMU_HP_ECPRIO_P5_S179L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S179L */
#define IFX_DMU_HP_ECPRIO_P5_S179L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S179L */
#define IFX_DMU_HP_ECPRIO_P5_S179L_OFF (19u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S180L */
#define IFX_DMU_HP_ECPRIO_P5_S180L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S180L */
#define IFX_DMU_HP_ECPRIO_P5_S180L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S180L */
#define IFX_DMU_HP_ECPRIO_P5_S180L_OFF (20u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S181L */
#define IFX_DMU_HP_ECPRIO_P5_S181L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S181L */
#define IFX_DMU_HP_ECPRIO_P5_S181L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S181L */
#define IFX_DMU_HP_ECPRIO_P5_S181L_OFF (21u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S182L */
#define IFX_DMU_HP_ECPRIO_P5_S182L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S182L */
#define IFX_DMU_HP_ECPRIO_P5_S182L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S182L */
#define IFX_DMU_HP_ECPRIO_P5_S182L_OFF (22u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S183L */
#define IFX_DMU_HP_ECPRIO_P5_S183L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S183L */
#define IFX_DMU_HP_ECPRIO_P5_S183L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S183L */
#define IFX_DMU_HP_ECPRIO_P5_S183L_OFF (23u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S184L */
#define IFX_DMU_HP_ECPRIO_P5_S184L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S184L */
#define IFX_DMU_HP_ECPRIO_P5_S184L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S184L */
#define IFX_DMU_HP_ECPRIO_P5_S184L_OFF (24u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S185L */
#define IFX_DMU_HP_ECPRIO_P5_S185L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S185L */
#define IFX_DMU_HP_ECPRIO_P5_S185L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S185L */
#define IFX_DMU_HP_ECPRIO_P5_S185L_OFF (25u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S186L */
#define IFX_DMU_HP_ECPRIO_P5_S186L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S186L */
#define IFX_DMU_HP_ECPRIO_P5_S186L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S186L */
#define IFX_DMU_HP_ECPRIO_P5_S186L_OFF (26u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S187L */
#define IFX_DMU_HP_ECPRIO_P5_S187L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S187L */
#define IFX_DMU_HP_ECPRIO_P5_S187L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S187L */
#define IFX_DMU_HP_ECPRIO_P5_S187L_OFF (27u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S188L */
#define IFX_DMU_HP_ECPRIO_P5_S188L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S188L */
#define IFX_DMU_HP_ECPRIO_P5_S188L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S188L */
#define IFX_DMU_HP_ECPRIO_P5_S188L_OFF (28u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S189L */
#define IFX_DMU_HP_ECPRIO_P5_S189L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S189L */
#define IFX_DMU_HP_ECPRIO_P5_S189L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S189L */
#define IFX_DMU_HP_ECPRIO_P5_S189L_OFF (29u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S190L */
#define IFX_DMU_HP_ECPRIO_P5_S190L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S190L */
#define IFX_DMU_HP_ECPRIO_P5_S190L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S190L */
#define IFX_DMU_HP_ECPRIO_P5_S190L_OFF (30u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S191L */
#define IFX_DMU_HP_ECPRIO_P5_S191L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S191L */
#define IFX_DMU_HP_ECPRIO_P5_S191L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S191L */
#define IFX_DMU_HP_ECPRIO_P5_S191L_OFF (31u)

/** \brief Length for Ifx_DMU_SF_STATUS_Bits.D1BUSY */
#define IFX_DMU_SF_STATUS_D1BUSY_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_STATUS_Bits.D1BUSY */
#define IFX_DMU_SF_STATUS_D1BUSY_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_STATUS_Bits.D1BUSY */
#define IFX_DMU_SF_STATUS_D1BUSY_OFF (1u)

/** \brief Length for Ifx_DMU_SF_STATUS_Bits.DFPAGE */
#define IFX_DMU_SF_STATUS_DFPAGE_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_STATUS_Bits.DFPAGE */
#define IFX_DMU_SF_STATUS_DFPAGE_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_STATUS_Bits.DFPAGE */
#define IFX_DMU_SF_STATUS_DFPAGE_OFF (20u)

/** \brief Length for Ifx_DMU_SF_CONTROL_Bits.LCKHSMUCB */
#define IFX_DMU_SF_CONTROL_LCKHSMUCB_LEN (2u)

/** \brief Mask for Ifx_DMU_SF_CONTROL_Bits.LCKHSMUCB */
#define IFX_DMU_SF_CONTROL_LCKHSMUCB_MSK (0x3u)

/** \brief Offset for Ifx_DMU_SF_CONTROL_Bits.LCKHSMUCB */
#define IFX_DMU_SF_CONTROL_LCKHSMUCB_OFF (0u)

/** \brief Length for Ifx_DMU_SF_CONTROL_Bits.CPROG */
#define IFX_DMU_SF_CONTROL_CPROG_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_CONTROL_Bits.CPROG */
#define IFX_DMU_SF_CONTROL_CPROG_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_CONTROL_Bits.CPROG */
#define IFX_DMU_SF_CONTROL_CPROG_OFF (16u)

/** \brief Length for Ifx_DMU_SF_CONTROL_Bits.CERASE */
#define IFX_DMU_SF_CONTROL_CERASE_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_CONTROL_Bits.CERASE */
#define IFX_DMU_SF_CONTROL_CERASE_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_CONTROL_Bits.CERASE */
#define IFX_DMU_SF_CONTROL_CERASE_OFF (17u)

/** \brief Length for Ifx_DMU_SF_OPERATION_Bits.PROG */
#define IFX_DMU_SF_OPERATION_PROG_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_OPERATION_Bits.PROG */
#define IFX_DMU_SF_OPERATION_PROG_MSK (0x1u)

